# Dataset

data = {'col1' : [1,2,3,4,5],'col2' : [45,None,34,None,34],'col3': "rohit kumar sharma google employee".split()}

Questions
Q1. Create a pandas dataframe with the above data.
Q2. Provide the shape of the data.
Q3. Provide the data types of each column.
Q4. How many non-null values does each column have.
Q5. Extract the col2 data as a Series data type and a dataframe data type.
Q6. Filter the data where col1 value is odd.
Q7. Filter the data where col2 value is Null.
Q8. Filter the data where col3 value > 'employee' and col1 value is even.
Q9. Create a new column called col4. col4 values condition: if col1 value is odd then square and if col1 value is even then cube.
Q10. Create a new column called col5. col5 values condition: first 3 alphabets of the col3 values.

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({'col1' : [1,2,3,4,5],
                    'col2' : [45,None,34,None,34],
                    'col3': "rohit kumar sharma google employee".split()})
df.head()

   col1  col2      col3
0     1  45.0     rohit
1     2   NaN     kumar
2     3  34.0    sharma
3     4   NaN    google
4     5  34.0  employee

In [4]:
df.shape

(5, 3)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int64
 1   col2    3 non-null      float64
 2   col3    5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [6]:
df[df['col1']%2!=0]

   col1  col2      col3
0     1  45.0     rohit
2     3  34.0    sharma
4     5  34.0  employee

In [7]:
df[df['col2'].isnull()==True]

   col1  col2    col3
1     2   NaN   kumar
3     4   NaN  google

In [8]:
df[(df['col3']> 'employee') & (df['col1']%2==0)]

   col1  col2    col3
1     2   NaN   kumar
3     4   NaN  google

In [ ]:
def square(x):
    return x**2

In [9]:
df['col4'] = df['col1'].apply(square)
df

   col1  col2      col3  col4
0     1  45.0     rohit     1
1     2   NaN     kumar     4
2     3  34.0    sharma     9
3     4   NaN    google    16
4     5  34.0  employee    25

In [10]:
df['col5'] = df['col3'].str[:3]
df

   col1  col2      col3  col4 col5
0     1  45.0     rohit     1  roh
1     2   NaN     kumar     4  kum
2     3  34.0    sharma     9  sha
3     4   NaN    google    16  goo
4     5  34.0  employee    25  emp